// Задача 10: Напишите программу, которая принимает на
// вход трёхзначное число и на выходе показывает вторую
// цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1
// Задача 15: Напишите программу, которая принимает на
// вход цифру, обозначающую день недели, и проверяет,
// является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

// Задача 10:

// Console.WriteLine("От вас нужено трехзначное число а мы выведем его вторую цифру");
// int x = int.Parse(Console.ReadLine());
// x = x % 100 / 10;
// Console.WriteLine($"вторая цифра введенного числа получилась {x}");

// Задача 15:

Console.WriteLine("Введите цифру дня недели, где 1 - это понедельник");
// string x = Console.ReadLine();
// string s = "76".Contains(x)? "Да":"Нет";
// Console.WriteLine(s);